#include <iostream>
#include <string>


/*
* Что мне следует сделать в первую очередь?
* 1.1. На вход поступает текст. Из этого текста мы считываем:
* -- Unic word - все уникальные слова в тексте:
* ---- Их количество
* ---- Какие другие уникальные слова идут после этого слова
* 1.2. На выходе мы должны получить двумерную Матрицу переходов.
* -- Под индексами подразумеваются Unic word.
* -- В качестве значений выступают значения от 0 до 1. Это вероятность выпадения слова в столбце если сгенерировалось слово в строке.
* 1.3. По итогу мы получаем:
* -- Двумерный массив со словами Unic word
* 
* 2. Делаем генератор предложений.
*/


int main()
{
	std::cout << "Hello, world!" << std::endl;
	return 0;
}